# Основы DataFrames, которые состоят из Series

In [126]:
import numpy as np
import pandas as pd

#shift + tab

In [127]:
my_df = pd.DataFrame(np.random.randn(4,5), [1,2,3,4], ['yellow', 'orange', 'red', 'green', 'blue'])

In [128]:
my_df

     yellow    orange       red     green      blue
1 -0.186215 -0.747232  1.743737  0.280334  0.976387
2 -0.890806  1.337814 -1.064275  0.560981  1.110134
3 -0.787999  1.390708  0.696914  1.066066 -0.136908
4  0.308412  2.243492  1.050017 -0.053497  0.067189

In [129]:
my_df['orange']

1   -0.747232
2    1.337814
3    1.390708
4    2.243492
Name: orange, dtype: float64

In [130]:
my_df['red']

1    1.743737
2   -1.064275
3    0.696914
4    1.050017
Name: red, dtype: float64

In [131]:
type(my_df['orange'])

pandas.core.series.Series

In [132]:
type(my_df)

pandas.core.frame.DataFrame

In [133]:
my_df[['yellow', 'blue']]

     yellow      blue
1 -0.186215  0.976387
2 -0.890806  1.110134
3 -0.787999 -0.136908
4  0.308412  0.067189

DataFrame уже

In [134]:
type(my_df[['yellow', 'blue']])

pandas.core.frame.DataFrame

In [135]:
my_df['indigo'] = my_df['blue']

In [136]:
my_df

     yellow    orange       red     green      blue    indigo
1 -0.186215 -0.747232  1.743737  0.280334  0.976387  0.976387
2 -0.890806  1.337814 -1.064275  0.560981  1.110134  1.110134
3 -0.787999  1.390708  0.696914  1.066066 -0.136908 -0.136908
4  0.308412  2.243492  1.050017 -0.053497  0.067189  0.067189

In [137]:
my_df['violet'] = my_df['blue'] + my_df['indigo']

In [138]:
my_df

     yellow    orange       red     green      blue    indigo    violet
1 -0.186215 -0.747232  1.743737  0.280334  0.976387  0.976387  1.952774
2 -0.890806  1.337814 -1.064275  0.560981  1.110134  1.110134  2.220269
3 -0.787999  1.390708  0.696914  1.066066 -0.136908 -0.136908 -0.273817
4  0.308412  2.243492  1.050017 -0.053497  0.067189  0.067189  0.134379

In [139]:
my_df['violet']

1    1.952774
2    2.220269
3   -0.273817
4    0.134379
Name: violet, dtype: float64

In [140]:
my_df.loc[2]

yellow   -0.890806
orange    1.337814
red      -1.064275
green     0.560981
blue      1.110134
indigo    1.110134
violet    2.220269
Name: 2, dtype: float64

In [141]:
my_df.iloc[1]

yellow   -0.890806
orange    1.337814
red      -1.064275
green     0.560981
blue      1.110134
indigo    1.110134
violet    2.220269
Name: 2, dtype: float64

In [142]:
my_df.iloc[2]

yellow   -0.787999
orange    1.390708
red       0.696914
green     1.066066
blue     -0.136908
indigo   -0.136908
violet   -0.273817
Name: 3, dtype: float64

указываем новые значения в строках

In [143]:
my_df.iloc[2] = my_df.iloc[1]

In [144]:
my_df.iloc[2]

yellow   -0.890806
orange    1.337814
red      -1.064275
green     0.560981
blue      1.110134
indigo    1.110134
violet    2.220269
Name: 3, dtype: float64

In [145]:
my_df

     yellow    orange       red     green      blue    indigo    violet
1 -0.186215 -0.747232  1.743737  0.280334  0.976387  0.976387  1.952774
2 -0.890806  1.337814 -1.064275  0.560981  1.110134  1.110134  2.220269
3 -0.890806  1.337814 -1.064275  0.560981  1.110134  1.110134  2.220269
4  0.308412  2.243492  1.050017 -0.053497  0.067189  0.067189  0.134379

In [146]:
my_df.loc[3,'orange']

np.float64(1.337814095028593)

In [147]:
my_df.loc[[1,3], ['blue', 'violet']]

       blue    violet
1  0.976387  1.952774
3  1.110134  2.220269

In [148]:
my_df.drop(3)

     yellow    orange       red     green      blue    indigo    violet
1 -0.186215 -0.747232  1.743737  0.280334  0.976387  0.976387  1.952774
2 -0.890806  1.337814 -1.064275  0.560981  1.110134  1.110134  2.220269
4  0.308412  2.243492  1.050017 -0.053497  0.067189  0.067189  0.134379

In [149]:
my_df

     yellow    orange       red     green      blue    indigo    violet
1 -0.186215 -0.747232  1.743737  0.280334  0.976387  0.976387  1.952774
2 -0.890806  1.337814 -1.064275  0.560981  1.110134  1.110134  2.220269
3 -0.890806  1.337814 -1.064275  0.560981  1.110134  1.110134  2.220269
4  0.308412  2.243492  1.050017 -0.053497  0.067189  0.067189  0.134379

In [150]:
my_df.drop(3, inplace=True)

In [151]:
my_df

     yellow    orange       red     green      blue    indigo    violet
1 -0.186215 -0.747232  1.743737  0.280334  0.976387  0.976387  1.952774
2 -0.890806  1.337814 -1.064275  0.560981  1.110134  1.110134  2.220269
4  0.308412  2.243492  1.050017 -0.053497  0.067189  0.067189  0.134379

In [152]:
my_df.drop('indigo', axis=1)

     yellow    orange       red     green      blue    violet
1 -0.186215 -0.747232  1.743737  0.280334  0.976387  1.952774
2 -0.890806  1.337814 -1.064275  0.560981  1.110134  2.220269
4  0.308412  2.243492  1.050017 -0.053497  0.067189  0.134379

In [153]:
my_df

     yellow    orange       red     green      blue    indigo    violet
1 -0.186215 -0.747232  1.743737  0.280334  0.976387  0.976387  1.952774
2 -0.890806  1.337814 -1.064275  0.560981  1.110134  1.110134  2.220269
4  0.308412  2.243492  1.050017 -0.053497  0.067189  0.067189  0.134379

In [154]:
my_df.drop('indigo', axis=1, inplace=True)

In [155]:
my_df

     yellow    orange       red     green      blue    violet
1 -0.186215 -0.747232  1.743737  0.280334  0.976387  1.952774
2 -0.890806  1.337814 -1.064275  0.560981  1.110134  2.220269
4  0.308412  2.243492  1.050017 -0.053497  0.067189  0.134379

it's tupple

In [156]:
my_df.shape

(3, 6)